zen = '''  Mobile	(0)
	ID	Title	Assigned To	Status	
Первый запуск, обучение	(2)
	ID	Title	Assigned To	Status	
	T413979	Первая установка приложения на устройство	Орунов Н.	Passed	
	T414698	Установка приложения "поверх" предыдущей версии	Орунов Н.	Passed	
Неавторизованный режим	(3)
Т.З. https://confluence.prostream.ru/pages/viewpage.action?pageId=42538379

	ID	Title	Assigned To	Status	
	T414676	Переход при нажатии на кнопки и ссылки.	Орунов Н.	Passed	
	T414678	Пустой массив Button в buttons_list	Орунов Н.	Passed	
	T414646	Анимация нажатия на кнопку.	Орунов Н.	Passed	
Навигационное меню	(1)
	ID	Title	Assigned To	Status	
	T413759	Переходы в пункты меню	Орунов Н.	Passed	
Мой МТС	(0)
	ID	Title	Assigned To	Status	
Баланс	(0)
	ID	Title	Assigned To	Status	
Action Sheet	(1)
ТЗ https://confluence.prostream.ru/pages/viewpage.action?pageId=38404774

Проверять на конфиге с прода (если в кейсе не сказано иное)

В конфиге должен присутствовать элемент action sheets
Во всех блоках "main_screen_header" в options должны быть строки payment и bill

	ID	Title	Assigned To	Status	
	T414345	Свайп "Списка действий" на android	Орунов Н.	Passed	
Скины (custom_segments)	(9)
https://confluence.prostream.ru/pages/viewpage.action?pageId=37218486

	ID	Title	Assigned To	Status	
	T414208	Пользователь относится к сегменту Default	Орунов Н.	Passed	
	T414210	Переходы по кнопкам в шапке для Default сегмента	Орунов Н.	Passed	
	T414206	Пользователь относится к сегменту Premium	Орунов Н.	Passed	
	T414207	Переходы по кнопкам в шапке для Premium сегмента	Орунов Н.	Passed	
	T414585	Пользователь относится к сегменту X	Орунов Н.	Passed	
	T414586	Переходы по кнопкам в шапке для X сегмента	Орунов Н.	Passed	
	T414587	Пользователь принадлежит к двум сегментам	Орунов Н.	Passed	
	T414254	Отображение шапки без картинки	Орунов Н.	Passed	
	T414209	Отображение сегмента с условием "и" взаимодействия меток	Орунов Н.	Passed	
Экраны премиум-режима	(4)
ТЗ - https://confluence.prostream.ru/pages/viewpage.action?pageId=36343198

	ID	Title	Assigned To	Status	
	T414058	Просмотр премиум-экранов	Орунов Н.	Passed	
	T414059	Переход к премиум-предложению	Орунов Н.	Passed	
	T414060	Закрытие экранов премиум	Орунов Н.	Passed	
	T414819	Переход к Чату	Орунов Н.	Passed	
Центр уведомлений	(1)
https://confluence.prostream.ru/pages/viewpage.action?pageId=37198426

	ID	Title	Assigned To	Status	
	T414030	Отображение иконки центра уведомлений на главном экране	Орунов Н.	Passed	
Услуги	(2)
	ID	Title	Assigned To	Status	
	T413676	Тапнуть на "Услуги" на главном экране | Отображается экран "Услуги"	Орунов Н.	Passed	
	T414642	В боковом меню выбрать раздел "Услуги" | Отображается экран "Услуги"	Орунов Н.	Passed	
Вкладка "Подключенные"	(1)
	ID	Title	Assigned To	Status	
	T414109	Отображение списка подключенных услуг	Орунов Н.	Passed	
Покупки	(3)
https://confluence.prostream.ru/pages/viewpage.action?pageId=41131666

	ID	Title	Assigned To	Status	
	T414568	У пользователя есть активная подписка в ПМК | Отображается кнопка "Покупки"	Орунов Н.	Passed	
	T414574	Переход на экран "Покупки"	Орунов Н.	Passed	
	T414569	У пользователя нет активной подписки в ПМК | Не отображается кнопка "Покупки"	Орунов Н.	Passed	
Вкладка "Доступные"	(3)
	ID	Title	Assigned To	Status	
	T414172	Отображении стоимости услуг	Орунов Н.	Passed	
	T414111	Сворачивание / разворачивание групп	Орунов Н.	Passed	
	T414113	Отображение подключенных услуг в списке доступных	Орунов Н.	Passed	
Кастомные услуги	(0)
	ID	Title	Assigned To	Status	
Вторая память	(17)
	ID	Title	Assigned To	Status	
	T413698	Зайти в приложение Мой МТС | На главном экране отображается баннер "Вторая память"	Орунов Н.	Passed	
	T413965	Нажать на баннер "Вторая память" на главном экране | Открывается экран услуги "Вторая память"	Орунов Н.	Passed	
	T413699	Услуги -> Доступные -> Интернет | Отображается услуга "Вторая память"	Орунов Н.	Passed	
	T413700	Подключение услуги	Орунов Н.	Passed	
	T413702	Увеличение объема - Отмена	Орунов Н.	Passed	
	T413701	Увеличение объема памяти	Орунов Н.	Passed	
	T413708	Тап на ссылку "Все возможности по управлению услугой"	Орунов Н.	Passed	
	T413709	Тап на "Подробные условия на сайте"	Орунов Н.	Passed	
	T413962	Статус бар "Загружать контакты в облако", услуга "Вторая память" подключена	Орунов Н.	Passed	
	T413963	Отключение статус бара "Загружать контакты в облако"	Орунов Н.	Passed	
	T413711	Свитчер у услуги "Вторая память" в "Доступных" услугах	Орунов Н.	Passed	
	T413710	Отключение услуги	Орунов Н.	Passed	
	T413712	Открытие станицы через поиск	Орунов Н.	Passed	
	T413960	Сворачивание/разворачивание способов подключения/отключения	Орунов Н.	Passed	
	T413961	Статус бар "Загружать контакты в облако", услуга "Вторая память" не подключена	Орунов Н.	Passed	
	T413966	Отображение баннера второй памяти на главном экране на тарифе Smart	Орунов Н.	Passed	
	T413967	Увеличение объема на тарифе Smart	Орунов Н.	Passed	
Роуминговые услуги	(6)
Проверить нижеприведенные кейсы для каждой услуги:

Забугорище,
Свободное путешествие,
Ноль без границ,
БИТ за границей,
Макси БИТ за границей,
Супер БИТ за границей,
50 SMS в Европе,
100 SMS в Европе, *50 SMS в поездках по Миру,
100 SMS в поездках по Миру.
	ID	Title	Assigned To	Status	
	T414410	Открыть карточку услуги из раздела "Услуги"	Орунов Н.	Passed	
	T414411	Открыть карточку услуги из раздела "В поездках"	Орунов Н.	Passed	
	T414412	Открыть карточку услуги через поиск	Орунов Н.	Passed	
	T414413	Сменить страну в селекторе выбора стран	Орунов Н.	Passed	
	T414414	Открыть карточку услуги из раздела "Услуги" при активном руминг-режиме	Орунов Н.	Passed	
	T414415	Открыть карточку услуги из раздела "В поездках" при активном руминг-режиме	Орунов Н.	Passed	
Goodok	(2)
	ID	Title	Assigned To	Status	
	T414634	Подключение услуги "GOOD'OK"	Орунов Н.	Passed	
	T414635	Подключение услуги через мелодию	Орунов Н.	Passed	
Мобильный интернет	(2)
ТЗ: https://confluence.prostream.ru/pages/viewpage.action?pageId=41878324

uvas_code: "PE0005.1" услуги "Мобильный интернет"
В конфиге в settings задать параметр "mobile_internet_uvas_code": "PE0005"
	ID	Title	Assigned To	Status	
	T414601	Отключение услуги из мини-карточки на вкладке "Доступные"	Орунов Н.	Passed	
	T414589	Отключение на странице карточки услуги	Орунов Н.	Passed	
МТС Бонус	(0)
Шаги перехода на экран:

Открыть Боковое меню
Нажать "МТС Бонус"
	ID	Title	Assigned To	Status	
Не участник программы	(4)
	ID	Title	Assigned To	Status	
	T414768	Переход на экран	Орунов Н.	Passed	
	T414769	Переход в App Store/Google Play	Орунов Н.	Passed	
	T414770	Переход в приложение МТС Cashback	Орунов Н.	Passed	
	T414841	Переход в Google Play	Орунов Н.	Passed	
О бонусной программе	(5)
	ID	Title	Assigned To	Status	
	T414774	Переход на экран "О бонусной программе"	Орунов Н.	Passed	
	T414779	Вопросы и ответы	Орунов Н.	Passed	
	T414780	Новости	Орунов Н.	Passed	
	T414781	Обратная связь	Орунов Н.	Passed	
	T414782	О программе	Орунов Н.	Passed	
Участник программы	(1)
	ID	Title	Assigned To	Status	
	T414843	Переход в Google Play	Орунов Н.	Passed	
Прогноз сгорания	(2)
	ID	Title	Assigned To	Status	
	T414791	Переход на экран - нет баллов	Орунов Н.	Passed	
	T414794	Переход на экран - есть баллы сгорания	Орунов Н.	Passed	
История	(1)
	ID	Title	Assigned To	Status	
	T414803	Переход на экран	Орунов Н.	Passed	
МТС Бонус - Заглушка на приглашение друга	(1)
	ID	Title	Assigned To	Status	
	T414842	Переход в Google Play	Орунов Н.	Passed	
Каталог вознаграждений	(1)
	ID	Title	Assigned To	Status	
	T414101	Отображение категорий бонусов	Орунов Н.	Passed	
Подарить баллы	(1)
	ID	Title	Assigned To	Status	
	T414804	Отображение экрана	Орунов Н.	Passed	
GOOD'OK	(2)
	ID	Title	Assigned To	Status	
	T413746	Отображение категории "Мелодии вместо гудков" с услугой GOOD'OK	Орунов Н.	Passed	
	T413747	Экран услуги GOOD'OK со списком мелодий	Орунов Н.	Passed	
МТС Cashback	(1)
Ссылка на ТЗ: https://confluence.prostream.ru/pages/viewpage.action?pageId=41131520
Дизайн iOS: https://app.zeplin.io/project/5846af3129e72dc614d4439f/dashboard?seid=5a28f3fffd5b3acfeb0ec5ed
Дизайн Android: https://app.zeplin.io/project/58da336bbb63601a986bc7d3/dashboard?seid=5a2924e65d96a31f841efd43

Как отказаться от участия в программе(Кэш хранится ~30 мин):
Скачать приложение МТС Cashback -> Авторизоваться -> Мой кэшбэк -> Настройки -> Прекратить участие в программе

Как подключить МТС Cashback:
Скачать приложение Мой МТС -> Авторизоваться -> Открыть боковое меню -> МТС Cashback -> Получать кэшбэк -> Стать участником

Как определить участник или нет:
Prod: на странице МТС Cashback у НЕ участника отображается кнопка Получать кэшбэк, у участника кнопки нет
Dev: Смотреть в логах, в ответ на запрос services_websso должны приходить услуги-метки PE14935 и\или FRMPMTSCB
Номера для тестирования:

Параметры настройки (условия)	Номер
Участник, B2C, кэшбэк больше 0 Начислена 1000 (он может расходоваться. Надо следить за этим)	9164025195
Участник, B2C, кэшбэк равен 0	9136044146
Участник, B2B	9851524270
НЕ участник, B2B	9161437730
НЕ участник, B2С, реципиент	9850231330
НЕ участник, B2С, НЕ реципиент	9269701361 (не тестовый. личный)
	ID	Title	Assigned To	Status	
	T414588	Обработка ошибки если нет интернета	Орунов Н.	Retest	
Экран МТС Cashback	(13)
Открыт экран МТС Cashback
	ID	Title	Assigned To	Status	
	T414580	Не участник МТС Cashback. Переход по предложению	Орунов Н.	Retest	
	T414579	Ссылка "Правила программы" в попапе "Стать участником"	Орунов Н.	Retest	
	T414575	Не участник МТС Cashback, тап по кнопке "Получать кэшбэк" | Предложение стать участником программы cashback	Орунов Н.	Retest	
	T414581	Участник МТС Cashback. Переход по предложению	Орунов Н.	Retest	
	T414577	Приложение МТС Cashback не установлено, перейти в приложение | Открывается Playmarket/appstore с приложением МТС Cashback	Орунов Н.	Retest	
	T414597	Кнопка "Загрузить" в информации	Орунов Н.	Retest	
	T414578	Приложение МТС Cashback установлено, перейти в приложение | Открывается приложение МТС Cashback	Орунов Н.	Retest	
	T414596	Кнопка "Открыть" в информации	Орунов Н.	Retest	
	T414582	Сделать pulltorefresh | Отображается анимация загрузки	Орунов Н.	Retest	
	T414576	Тап по кнопке "Правила программы" | Открываются правила программы "МТС cashback"	Орунов Н.	Retest	
	T414603	Стать участником абонент b2c	Орунов Н.	Retest	
	T414604	Стать участником абонент b2b	Орунов Н.	Retest	
	T414605	Склонение слова "Предложений"	Орунов Н.	Retest	
Промо-экран	(8)
	ID	Title	Assigned To	Status	
	T414237	Отображение баланса кэшбэка в промо	Орунов Н.	Passed	
	T414236	Проверка промо экрана Cashback на модальность	Орунов Н.	Passed	
	T414300	Пользователь принадлежит сегменту condition_promo_1	Орунов Н.	Retest	
	T414567	Пользователь принадлежит сегменту condition_promo_2	Орунов Н.	Retest	
	T414301	Пользователь принадлежит сегменту condition_promo_3	Орунов Н.	Retest	
	T414302	Пользователь принадлежит сегменту condition_promo_4	Орунов Н.	Retest	
	T414303	Пользователь принадлежит сегменту condition_promo_5	Орунов Н.	Retest	
	T414304	Пользователь принадлежит сегменту condition_promo_6	Орунов Н.	Retest	
Переход в раздел МТС Cashback	(4)
	ID	Title	Assigned To	Status	
	T414570	Не участник МТС Cashback | Отображаются предложения и кнопка "Получать кэшбэк"	Орунов Н.	Retest	
	T414571	Участник МТС Cashback | Отображаются предложения, кнопки "Получать кэшбэк" нет	Орунов Н.	Retest	
	T414572	Абонент премиум | Часть предложений отображается с лейблом "Premium"	Орунов Н.	Retest	
	T414573	Абонент не премиум | Предложения с лейблом "Premium" не отображаются	Орунов Н.	Retest	
Роуминг-режим	(12)
https://confluence.prostream.ru/pages/viewpage.action?pageId=33884116
Включение симуляции роуминга через MyPreferences:
https://confluence.prostream.ru/pages/viewpage.action?pageId=37215145
https://confluence.prostream.ru/display/RUMTSSRV/My+Mts+Preferences
Также можно использовать сим-карты для номеров 79150715135 и 79150715213, используя мобильное подключение к интернету (они замоканы на разные страны)

Общие прекондишены для кейсов
Приложение установлено
Пользователь авторизован
Пользователь находится в международном роуминге
Роуминг-режим включен

	ID	Title	Assigned To	Status	
	T413793	Отображение главной в РР	Орунов Н.	Passed	
	T414352	Тап на "Кошелек", отображение списка действий	Орунов Н.	Passed	
	T413806	Доступность оплаты счета в РР	Орунов Н.	Passed	
	T413809	Клик по баннеру "Номер находится в роуминге" на главном экране	Орунов Н.	Passed	
	T413810	Клик по баннеру "Услуги для роуминга" на экране "Интернет"	Орунов Н.	Passed	
	T413811	Клик по баннеру "Услуги для роуминга" на экране "Пакеты звонков"	Орунов Н.	Retest	
	T413812	Клик по баннеру "Услуги для роуминга" на экране "Пакеты сообщений"	Орунов Н.	Retest	
	T413808	МТС Бонус - раскрыта группа "Роуминг"	Орунов Н.	Passed	
	T413807	Клик по (i) в разделе МТС Бонус - Продолжить	Орунов Н.	Passed	
	T413814	Клик по (i) в разделе МТС Бонус - Отмена	Орунов Н.	Passed	
	T413797	Блокировка экранов web-view	Орунов Н.	Passed	
	T413813	Отсутствие кнопок "Услуги для роуминга" при выключенном роуминг-режиме	Орунов Н.	Passed	
Боковое меню	(9)
	ID	Title	Assigned To	Status	
	T413794	Блокировка пунктов меню при включенном РР	Орунов Н.	Passed	
	T413795	Нажатие на неактивный пункт меню в РР - Отмена	Орунов Н.	Passed	
	T413804	Нажатие на неактивный пункт меню - Перейти	Орунов Н.	Passed	
	T413805	Доступность всех пунктов меню при отключенном РР	Орунов Н.	Passed	
	T414222	Переход на главный экран при включении РР	Орунов Н.	Passed	
	T414951	Переход по внешней ссылке - Перейти	Орунов Н.	Passed	
	T414952	Переход по внешней ссылке - Отмена	Орунов Н.	Passed	
	T414953	Переход по внешней ссылке из услуг, тарифов - Перейти	Орунов Н.	Passed	
	T414954	Переход по внешней ссылке из услуг, тарифов - Отмена	Орунов Н.	Passed	
Раздел "Поддержка"	(5)
	ID	Title	Assigned To	Status	
	T413815	Пункт "Технические работы"	Орунов Н.	Passed	
	T413816	Пункт "Обратная связь"	Орунов Н.	Passed	
	T413817	Пункт "Позвонить в КЦ"	Орунов Н.	Passed	
	T413818	Пункт "Перейти на сайт МТС"	Орунов Н.	Passed	
	T413798	Пункт «Пройти обучение»	Орунов Н.	Passed	
'''




zen_map = dict()

for word in zen.split():
    cleaned_word = word.strip('| * ; ! , : / ').lower()
    if cleaned_word not in zen_map:
        zen_map[cleaned_word] = 0

    zen_map[cleaned_word] += 1

print(zen_map)



